[
    "I'm looking for a 24-hour pharmacy in Montreal, can you find one for me?",
    "Could you suggest a good bookstore that has a large collection of science fiction novels in Chicago?",
    "Give me the phone number for the nearest post office in Vancouver.",
    "Can you give me a list of bars in New Orleans that have live music?",
    "Are there any farmers markets in San Diego that sell organic produce?",
    "What are the top-rated seafood restaurants in Cancun, Mexico with an ocean view?",
    "I need to find a hospital in Tokyo that specializes in cardiology. Can you provide me with a list?",
    "Can you give me some information about the historical landmarks in Athens?",
    "I need to find a laundromat in Denver, CO. Can you suggest any?",
    "Is there a park near the Metropolitan Museum of Art in New York City?",
    "Where can I find a good dry cleaner in the downtown area of Seattle?",
    "Is there a pharmacy in the financial district of Sydney that is open 24/7?",
    "Can you recommend a hotel in New York City that has a swimming pool?",
    "What are some popular tourist attractions in Amsterdam?",
    "Can you provide a list of wedding venues in Sydney that offer outdoor ceremonies?",
    "Which museums in London have free admission?",
    "What are the popular tourist attractions near Times Square, New York City?",
    "Show me the address of the nearest post office in Amsterdam.",
    "Is there a pharmacy near Times Square in New York City?",
    "Give me a list of hair salons in Rome that specialize in coloring hair.",
    "What is the phone number for the nearest taxi service in Atlanta?",
    "What is the phone number of the nearest 24-hour convenience store to Times Square in New York City?",
    "I need to book a conference room for a meeting in New York City. Can you give me a list of available options?",
    "What is the best way to get to the Hollywood Walk of Fame in Los Angeles?",
    "Can you suggest some scenic running trails in Central Park, New York City?",
    "I need to renew my passport. Can you provide me with a list of passport offices in New York City?",
    "I'm looking for a gym in Toronto that offers a free trial, can you help me find one?",
    "I’m looking for a pet store in San Diego that sells hamsters. Can you help me find one?",
    "What are some popular bars in Barcelona, Spain?",
    "What is the phone number for the British Museum in London?",
    "Are there any luxury hotels in the Loop area of Chicago?",
    "What is the phone number for the nearest movie theater in Los Angeles?",
    "What are the best rooftop bars to visit in Bangkok, Thailand?",
    "What's the phone number for the nearest hospital's emergency room?",
    "Can you recommend a vegan restaurant in Los Angeles that has outdoor seating?",
    "What are some famous landmarks in the Champs-Élysées area of Paris?",
    "What are the most famous landmarks in Rio de Janeiro?",
    "What are some good Chinese restaurants in Vancouver, Canada with their website urls?",
    "Can you provide the contact information for the nearest pharmacy in London?",
    "Can you provide me with information on the best vegan restaurants in Portland, OR?",
    "What are some vegetarian restaurants in Los Angeles with their phone numbers and website urls?",
    "Can you recommend a kid-friendly museum in Chicago?",
    "Can you help me find a movie theater in London with an IMAX screen, along with its address and website url?",
    "Can you suggest a good café in Paris that serves croissants and coffee?",
    "What are the best art galleries to visit in London, UK?",
    "What is the address of the nearest pharmacy in San Diego, California?",
    "Is there a public library in Houston that offers 3D printing services? If so, can you give me its address and hours?",
    "Can you provide the phone number for the nearest urgent care clinic in London?",
    "Give me the address of the nearest grocery store to the Statue of Liberty.",
    "Can you locate a hardware store in the West End area of London?",
    "Can you recommend a good seafood restaurant in Boston, Massachusetts?",
    "What is the address of the nearest pharmacy to Times Square?",
    "Are there any outdoor sports equipment stores near Griffith Observatory in Los Angeles? If yes, could you give me their phone numbers and addresses?",
    "Is there a McDonald's near the Eiffel Tower in Paris? If so, what is the address?",
    "Where can I find a beach resort in Cancun that offers all-inclusive packages?",
    "Can you provide me the website URL of the nearest zoo to Times Square in New York City?",
    "Can you provide directions to the closest gas station to my current location?",
    "Can you provide me with a list of Italian restaurants in San Francisco that have outdoor seating?",
    "What are some casinos in Las Vegas with free parking?",
    "Are there any rooftop bars with a view of the city in Hong Kong, China?",
    "Provide me with the website for the Vatican Museums in Rome.",
    "Can you recommend some vegan restaurants in Seattle?",
    "I'm looking for a gym in Chicago that offers yoga classes. Can you recommend any?",
    "What are some affordable yet high-quality hotels in downtown Vancouver?",
    "I want to join a yoga class in Austin. Can you provide me with a list of popular yoga studios with their phone numbers?",
    "Are there any good breakfast places in London that serve traditional English breakfast?",
    "Can you give me the phone number for a taxi service in New Orleans?",
    "Is there any famous bookshop in Seattle? If yes, can you provide some information about it?",
    "What is the website of the Golden Gate Bridge in San Francisco?",
    "Can you list all movie theaters in San Francisco, California?",
    "Which stores in Sydney sell designer clothes?",
    "Could you give me the location of a pet store in San Diego that offers grooming services?",
    "Show me some popular dessert shops in Chicago.",
    "What are the top-rated coffee shops in Austin?",
    "Can you find a grocery store in the Brooklyn area that offers home delivery?",
    "List all the parking garages near the Staples Center in Los Angeles.",
    "Is there a website where I can purchase tickets for the CN Tower in Toronto?",
    "Recommend some museums in Washington D.C. that are open on Monday.",
    "Can you provide me a list of hotels in Dubai, United Arab Emirates that offer airport shuttle services?",
    "Where can I find a good Italian restaurant in Chicago?",
    "List all the shopping malls in Bangkok.",
    "What are some popular rooftop bars in Bangkok?",
    "Are there any libraries open on Sundays in San Francisco?",
    "I'm looking for a hairstylist who specializes in curly hair. Can you give me a list of salons in Miami?",
    "Can you suggest some good pubs in London?",
    "What are some popular food trucks in Austin that serve tacos?",
    "What is the address and phone number of the nearest pharmacy to my hotel in Los Angeles?",
    "Can you provide a list of the best seafood restaurants in Sydney, Australia?",
    "I'm looking for a bookstore in Paris that has a good selection of English language books. Can you give me some recommendations?",
    "What are the top tourist attractions in Tokyo?",
    "Where can I find a vegan restaurant near my hotel in Austin, Texas?",
    "Can you provide a list of museums in Washington D.C.?",
    "I'm traveling to Sydney and interested in visiting a zoo. Can you recommend one and provide me with the address?",
    "What is the address of the closest parking lot to the Golden Gate Bridge in San Francisco?",
    "What hotels in Las Vegas offer a free shuttle service to the airport?",
    "What are some popular tourist attractions to visit in Seattle?",
    "Where can I find the closest post office to the Empire State Building?",
    "What is the address for the Space Needle in Seattle?",
    "I need the address for the nearest police station to my current location in Houston.",
    "What are some highly rated bakeries in Toronto, Canada?"
]