[
    "What was the volume of trades made for Coca-Cola on March 1, 2022?",
    "What is the monthly trading volume of Microsoft in October 2020?",
    "I am planning a trip to Seoul, could you give me the weather forecast for the next week, including the chance of snowfall?",
    "What is the opening price of Microsoft on August 1, 2021?",
    "What is the address of the nearest pharmacy in San Diego, California?",
    "Could you suggest a good bookstore that has a large collection of science fiction novels in Chicago?",
    "How windy will it be in Chicago, USA, next Wednesday, and what's the expected wind direction?",
    "How much was the opening price of Coca-Cola stocks on July 1, 2019?",
    "What is the precipitation rate expected in Toronto, Canada, next Thursday?",
    "Please provide the exchange volume of Alibaba's stock on December 1, 2021.",
    "Inquire about the exchange volume of Alibaba stocks in the last quarter.",
    "Please tell me the current close status of the London Stock Exchange.",
    "What is the pressure trend in Mexico City, Mexico over the last 24 hours?",
    "Can you suggest some good pubs in London?",
    "What is the highest stock price of Google on January 1, 2022?",
    "Is it going to rain in London next week, and what is the probability of thunderstorms on specific days?",
    "Show me the highest stock price of Amazon on December 24, 2018.",
    "I am planning a weekend trip to Las Vegas. Can you predict the expected high and low temperature during my trip?",
    "I'm planning a road trip in the United States, could you suggest the best route for avoiding any potential heavy snowfall during winter?",
    "What are some popular tourist attractions to visit in Seattle?",
    "What is the address and phone number of the nearest pharmacy to my hotel in Los Angeles?",
    "Can you provide me with the weather forecast for New York City on July 4th, and what will be the expected high and low temperatures?",
    "Can you provide me the opening price of Amazon's stock on January 1, 2021?",
    "Can you suggest the best time to plan a trek to Everest Base Camp, Nepal, by analyzing the weather forecast?",
    "I’m looking for a pet store in San Diego that sells hamsters. Can you help me find one?",
    "What is the phone number for the British Museum in London?",
    "Is it safe to go hiking in the mountains near Denver, Colorado, today, given the current weather condition and visibility?",
    "Are there any libraries open on Sundays in San Francisco?",
    "Look up the lowest stock price of Procter & Gamble on July 8, 2020.",
    "Can you provide me with the maximum wind speed and direction in Chicago next Monday?",
    "What is the website of the Golden Gate Bridge in San Francisco?",
    "Is there a chance of precipitation in Kyoto, Japan next month? If so, what is the expected amount?",
    "Can you find a grocery store in the Brooklyn area that offers home delivery?",
    "I am planning to attend a family reunion at a beach in Hawaii next month. Can you provide the forecast of the temperature, humidity, and UV index during the day time?",
    "What are some popular tourist attractions in Amsterdam?",
    "Can you provide me the website URL of the nearest zoo to Times Square in New York City?",
    "Can you provide me with the average temperature and UV index for Cancun, Mexico during the month of August, and is it a good time to visit?",
    "What was the close price for Microsoft on October 5th, 2021?",
    "What is the chance of thunderstorms in Rio de Janeiro, Brazil, next week and what will be the temperature and humidity during those days?",
    "Is there any chance of rain in Tokyo, Japan for the next five days?",
    "How much did the US stock market rise yesterday?",
    "Can you provide directions to the closest gas station to my current location?",
    "Can you tell me the weather forecast for Paris, France for the next 7 days?",
    "Can you provide me with information on the best vegan restaurants in Portland, OR?",
    "Can you provide me with the forecast for San Francisco for the next week, including the expected precipitation and wind speed on each day?",
    "What was the highest stock price of Facebook on June 16, 2015?",
    "How windy is it expected to be in Toronto, Canada tomorrow afternoon?",
    "Can you give me the highest price of Twitter's stock on January 3, 2020?",
    "Which stores in Sydney sell designer clothes?",
    "Can you give me some information about the historical landmarks in Athens?",
    "I need to find a laundromat in Denver, CO. Can you suggest any?",
    "What are the top tourist attractions in Tokyo?",
    "Find the highest price of Paypal in 2021.",
    "I'm looking for a gym in Toronto that offers a free trial, can you help me find one?",
    "How much did Facebook's stock price change from its opening to its closing on March 15, 2021?",
    "Inquire about the exchange volume of Adobe on April 6, 2022.",
    "How much did Tesla's stock drop on Monday?",
    "What is the overall weather condition for the whole day in Cairo, Egypt?",
    "What is the weather forecast for Paris, France on New Year's day?",
    "What is the average temperature in Toronto, Canada for the month of October, and how much rainfall can be expected?",
    "What are some famous landmarks in the Champs-Élysées area of Paris?",
    "Where can I find a good dry cleaner in the downtown area of Seattle?",
    "What is the temperature and humidity in Bangkok's night market?",
    "Can you tell me if there are any weather alerts or warnings currently in effect for Auckland, New Zealand?",
    "I am interested in knowing the high and low prices of Amazon's stock for the month of June 2021.",
    "I am traveling to Rome, Italy next week, what is the average temperature and daylight hours there during this time?",
    "What was the closing price of Tesla stock on December 30, 2021?",
    "What's the phone number for the nearest hospital's emergency room?",
    "Can you tell me the stock price for Google's opening in the Japanese market?",
    "Can you provide me with the details of Apple's stock on the first day of every month in 2021?",
    "Can you provide a list of the best seafood restaurants in Sydney, Australia?",
    "Please give me the trading volume of Amazon for the past week.",
    "I am planning a hiking trip in the Swiss Alps next month. Can you give me a weather forecast for the region during my stay?",
    "I am planning a trip to Sydney, Australia next week, can you give me the expected weather conditions and temperature?",
    "Can you provide me the exchange rate for Japanese yen (JPY) to US dollars (USD) in the past month?",
    "I'm looking for a bookstore in Paris that has a good selection of English language books. Can you give me some recommendations?",
    "Is there a pharmacy in the financial district of Sydney that is open 24/7?",
    "Can you provide the weather forecast for New York City, New York, for tomorrow morning at 7 am, including the expected wind speed and direction?",
    "What are some good Chinese restaurants in Vancouver, Canada with their website urls?",
    "What are some highly rated bakeries in Toronto, Canada?",
    "What is the expected humidity level in Dubai, United Arab Emirates in the coming week?",
    "Is there any risk of thunderstorms in Toronto next week? If yes, when is it expected to happen?",
    "What is the current exchange volume for Microsoft stock this month?",
    "What are the top-rated seafood restaurants in Cancun, Mexico with an ocean view?",
    "Give me a list of hair salons in Rome that specialize in coloring hair.",
    "Is there any chance of a thunderstorm in New Delhi, India, this evening, and is it advisable to stay indoors during such conditions?",
    "Can you help me find a movie theater in London with an IMAX screen, along with its address and website url?",
    "I'm planning a beach day in Miami, Florida. Will it be a sunny day or should I prepare for rain?",
    "List all the parking garages near the Staples Center in Los Angeles.",
    "What is the current opening price of gold on the London Metal Exchange (LME)?",
    "What are the best rooftop bars to visit in Bangkok, Thailand?",
    "Can you provide me the UV index for Seoul, South Korea in the late afternoon on a typical day in winter?",
    "Give me the trading volume for Amazon on Black Friday in 2020.",
    "Can you tell me the open status for the London Stock Exchange today?",
    "What is the weather like currently in Tokyo, Japan, and what is the expected weather for the rest of the day?",
    "What is the current stock price and volume of Amazon?",
    "What is the current exchange rate for USD (US Dollar) to EUR (Euro)?",
    "What is the current market status in the UK regarding the Dow Jones Industrial Average?",
    "Can you give me the latest information on the Chinese stock market?",
    "How much was the trading volume of General Electric on October 23, 2018?",
    "What is the exchange rate of Japanese yen (JPY) to British pounds (GBP) on December 1, 2021?",
    "What were the open and close prices of Facebook on its first day of trading?",
    "Can you provide the wind speed and UV index for Los Angeles, California for the next three days?",
    "Is it safe to travel to Tokyo today given the forecasted weather conditions?",
    "What was the trading volume of Amazon on June 15, 2018?",
    "Can you provide me with Apple's trading volume on May 10, 2019?",
    "I have plans to attend an outdoor wedding in San Diego, California next month. What is the expected weather for that day?",
    "List all the shopping malls in Bangkok.",
    "What was the open price of Facebook's stock on the first day of trading in the year 2015?",
    "How much was the opening stock price of Amazon on January 1, 2020?",
    "How high is the chance of precipitation in Miami, Florida, USA tomorrow?",
    "What hotels in Las Vegas offer a free shuttle service to the airport?",
    "Could you retrieve the trading volume of Microsoft's stock on November 30, 2018?",
    "Please provide me with the highest price of Facebook's stock in the last quarter.",
    "How hot is it in Las Vegas, Nevada today? Should I bring a jacket for the cooler evening temperatures?",
    "Is there a McDonald's near the Eiffel Tower in Paris? If so, what is the address?",
    "Can you recommend a vegan restaurant in Los Angeles that has outdoor seating?",
    "I'm planning an outdoor wedding in Paris next month. Can you provide me with the expected weather conditions and suggest appropriate attire for the guests?",
    "I'm traveling to Sydney and interested in visiting a zoo. Can you recommend one and provide me with the address?",
    "Can you give me the opening price of Microsoft for the month of January 2021?",
    "What is the closing information for the Nigerian stock exchange for the month of May 2021?",
    "Can you provide the detailed wind conditions for San Francisco Bay Area tomorrow?",
    "I'm planning an outdoor wedding in Seattle, Washington next month. Can you tell me what the average temperature and humidity will be like during the daytime?",
    "Can I know the humidity levels in Tokyo today, and will it be uncomfortable for people sensitive to humidity?",
    "Can you give me the wind speed and direction at the current time in New York City?",
    "What is the closing price of Johnson & Johnson's stock on July 1, 2015?",
    "Can you provide me with the weather forecast for Miami, Florida for the next 24 hours, including the humidity and visibility?",
    "Check the exchange rate between the British pound and the Australian dollar.",
    "What is the address of the closest parking lot to the Golden Gate Bridge in San Francisco?",
    "Can you give me a list of bars in New Orleans that have live music?",
    "Can you tell me the expected temperature of Vancouver, Canada next month during the daytime?",
    "Are there any outdoor sports equipment stores near Griffith Observatory in Los Angeles? If yes, could you give me their phone numbers and addresses?",
    "Can you give me the phone number for a taxi service in New Orleans?",
    "Show me the address of the nearest post office in Amsterdam.",
    "What was the lowest price of Amazon stock on May 21, 2022?",
    "What will be the sunset time in Rome three days from now?",
    "Tell me about the highest and lowest prices of NVIDIA on October 10, 2019.",
    "I need the address for the nearest police station to my current location in Houston.",
    "What is the address for the Space Needle in Seattle?",
    "What is the best way to get to the Hollywood Walk of Fame in Los Angeles?",
    "What is the current cloud coverage in Mumbai, India?",
    "Can you recommend a good seafood restaurant in Boston, Massachusetts?",
    "Please tell me the lowest stock price for Microsoft on June 30, 2021.",
    "Is there any potential for thunderstorms in New York City, United States, later today?",
    "Where can I find a good Italian restaurant in Chicago?",
    "I need to book a conference room for a meeting in New York City. Can you give me a list of available options?",
    "What was the opening price of Facebook on December 1, 2021?",
    "What is the expected visibility in Beijing, China, at 7 pm this evening?",
    "How much was Tesla's stock worth on the day it went public?",
    "I'm planning a day trip to Paris next week, can you predict the expected UV index levels during that time?",
    "Can you retrieve the opening and closing price of Tesla on June 12, 2021?",
    "What is the phone number for the nearest taxi service in Atlanta?",
    "What will be the average temperature and pressure in Berlin, Germany two weeks from now?",
    "How much did Amazon's stock close at yesterday?",
    "What was the exchange rate from US dollars to GBP yesterday?",
    "What is the current weather condition in New York City?",
    "What is the chance of thunderstorms in Miami Beach tomorrow?",
    "I'm looking for a 24-hour pharmacy in Montreal, can you find one for me?",
    "Look up the opening information for the stock market in Brazil today.",
    "Can you provide the contact information for the nearest pharmacy in London?",
    "Is there a park near the Metropolitan Museum of Art in New York City?",
    "Can you locate a hardware store in the West End area of London?",
    "How much snowfall can we expect in Quebec City, Canada in the next 3 days?",
    "Tell me the high price of Amazon's stock on December 1, 2021.",
    "Can you provide me with the weather forecast for Los Angeles next week?",
    "What are some vegetarian restaurants in Los Angeles with their phone numbers and website urls?",
    "How will the weather be for hiking in the Rocky Mountains National Park in Colorado, USA, starting from 3 days from now?",
    "How much precipitation is expected in London tomorrow morning between 7 to 11 AM?",
    "What is the expected amount of precipitation in Seattle, Washington, this month?",
    "Can you tell me the closing price of Netflix on February 28th, 2022?",
    "What is the expected pressure in Tokyo tomorrow?",
    "Can you please look up the current closing information for the US stock market?",
    "Can you provide information about the wind speed and visibility in Honolulu, Hawaii right now?",
    "Can you provide me with the exchange rate for USD to EUR?",
    "What is the weather forecast for Paris, France, on the upcoming weekend? Is it a good time for outdoor activities?",
    "Can you tell me the overall weather for Sydney, Australia next week?",
    "What was Intel's highest trading price in the last year?",
    "Please provide the opening price of Facebook on November 4, 2019.",
    "Could you give me the location of a pet store in San Diego that offers grooming services?",
    "I want to join a yoga class in Austin. Can you provide me with a list of popular yoga studios with their phone numbers?",
    "Can you provide the phone number for the nearest urgent care clinic in London?",
    "What is the weather forecast for Los Angeles on Thanksgiving Day?",
    "Can you give me the wind speed and direction for Barcelona, Spain for the rest of the day?",
    "What was the opening price of Facebook's stock on May 10, 2021?",
    "Can you tell me the opening price of Walmart stock on the first trading day of this month?",
    "What was Amazon's stock price at the end of the last trading day of the year 2019?",
    "Where can I find a beach resort in Cancun that offers all-inclusive packages?",
    "Can you provide me a list of hotels in Dubai, United Arab Emirates that offer airport shuttle services?",
    "What is the likelihood of a thunderstorm occurring in Houston, Texas next weekend?",
    "How cold will it get tonight in Anchorage, Alaska?",
    "How much is one Chinese yuan (CNY) worth in US dollars (USD) today?",
    "Tell me the closing price of Netflix's stock on August 23, 2021?",
    "I'm looking for a hairstylist who specializes in curly hair. Can you give me a list of salons in Miami?",
    "Give me the address of the nearest grocery store to the Statue of Liberty.",
    "What will be the temperature in Bangalore tomorrow?",
    "What is wind speed expected to be in Cancun, Mexico, tomorrow morning?",
    "How much snowfall is expected in Anchorage, Alaska, next week?",
    "Can you provide me with the weather forecast for Los Angeles, California for the next 7 days?",
    "Is it safe to plan an outdoor wedding in Auckland, New Zealand next week based on the expected weather conditions?",
    "I'm planning to go hiking in the Alps next weekend. Can you tell me the expected wind speed at the summit?",
    "Is there a chance of thunderstorms in Miami, Florida today and if so, what is the expected amount of precipitation?",
    "How much precipitation is expected in Seoul, South Korea next month?",
    "What will be the weather forecast for London, UK, on the fourth day from now?",
    "Is there a public library in Houston that offers 3D printing services? If so, can you give me its address and hours?",
    "Are there any rooftop bars with a view of the city in Hong Kong, China?",
    "Can you recommend some vegan restaurants in Seattle?",
    "Is there any famous bookshop in Seattle? If yes, can you provide some information about it?",
    "Can you provide the visibility distance for Chicago right now?",
    "What is the address of the nearest pharmacy to Times Square?",
    "Can you provide a list of museums in Washington D.C.?",
    "What are the best art galleries to visit in London, UK?",
    "Can you give me the trading volume of Google stock on March 5, 2020?",
    "What is the current exchange rate of USD to EUR on the New York Stock Exchange?",
    "Can you give me the weather conditions for the next 10 days in London, United Kingdom? I want to plan my wardrobe accordingly for my upcoming trip.",
    "Are there any luxury hotels in the Loop area of Chicago?",
    "Can you provide the current exchange rate for the United States dollar (USD) to the Euro (EUR)?",
    "Could you tell me the current cloud cover percentage in Paris, France, and will it increase or decrease in the next few hours?",
    "What was the closing price of Tesla's stock on the last trading day of 2021?",
    "Can you give me the closing price of Exxon Mobil's stock on December 31, 2020?",
    "Provide the highest and lowest prices for Alibaba's stock in the month of May 2020.",
    "Can you suggest some scenic running trails in Central Park, New York City?",
    "Is there a pharmacy near Times Square in New York City?",
    "What is the exchange volume for Apple stocks on September 1, 2021?",
    "Is there a website where I can purchase tickets for the CN Tower in Toronto?",
    "What will be the weather like in Sydney, Australia next week?",
    "What are the most famous landmarks in Rio de Janeiro?",
    "What are the popular tourist attractions near Times Square, New York City?",
    "What is the chance of snowfall in London, UK three days from now, and if it does snow, how much accumulation is expected?",
    "Show me some popular dessert shops in Chicago.",
    "Where can I find the closest post office to the Empire State Building?",
    "What are some casinos in Las Vegas with free parking?",
    "I need to renew my passport. Can you provide me with a list of passport offices in New York City?",
    "What was the closing price of IBM on August 25, 2020?",
    "Can you list all movie theaters in San Francisco, California?",
    "Where can I find a vegan restaurant near my hotel in Austin, Texas?",
    "How much did Amazon's stock price increase on February 1, 2022?",
    "What is the current exchange rate for the Japanese yen (JPY) to the Chinese yuan (CNY)?",
    "I'm looking for a gym in Chicago that offers yoga classes. Can you recommend any?",
    "What was the closing price of Microsoft's stock on May 3, 2021?",
    "Can you provide a list of wedding venues in Sydney that offer outdoor ceremonies?",
    "How much was the exchange volume of Amazon on October 1, 2021?",
    "What is the opening price of Google on August 24, 2020?",
    "How many shares of Google were traded on July 20, 2020?",
    "What are some popular rooftop bars in Bangkok?",
    "Is it a good day for surfing in Honolulu today?",
    "How strong will the winds be in Amsterdam, Netherlands, on the 17th of September?",
    "Can you provide the current weather conditions in Sydney, Australia, including the wind speed and humidity level?",
    "Can you provide me with a list of Italian restaurants in San Francisco that have outdoor seating?",
    "Please look up the close price of Google's stock on February 28, 2020.",
    "Is there a typhoon warning in Tokyo, Japan today?",
    "Provide me the trading volume of Amazon's stock on June 3, 2016.",
    "Can you provide me with details about the opening status of the London Stock Exchange?",
    "Can you recommend a kid-friendly museum in Chicago?",
    "I'll be taking a road trip from San Francisco to Los Angeles in 2 days. Can you tell me the expected temperature, cloud cover, and visibility levels along the way?",
    "Is there a chance of thunderstorms in New York City tonight?",
    "Computer, what is the current stock price of General Electric?",
    "Can you give me the temperature in Beijing, China in both Celsius and Fahrenheit?",
    "I'm planning to go for a boat ride off the coast of Phuket, Thailand, next weekend. Can you tell me what to expect in terms of wind speed and precipitation?",
    "What was the last trading price of Facebook's stock on the date of its initial public offering?",
    "What are some popular food trucks in Austin that serve tacos?",
    "Could you give me the opening and closing prices of Alphabet's stock on December 25, 2021?",
    "Which museums in London have free admission?",
    "What's the expected UV index in Tokyo, Japan, tomorrow?",
    "Is the Australian stock market open now?",
    "Inquire the open status of the NASDAQ today.",
    "What is the phone number of the nearest 24-hour convenience store to Times Square in New York City?",
    "Can you provide me with the closing price of Alibaba Group's stock last month?",
    "Recommend some museums in Washington D.C. that are open on Monday.",
    "Can you provide me the closing price of Google on the previous Friday?",
    "I'm planning a road trip from Las Vegas to Denver. Can you provide me with the weather forecast for the entire route?",
    "Retrieve the closing price of Coca Cola's stock on January 5, 2015.",
    "Are there any good breakfast places in London that serve traditional English breakfast?",
    "Are there any farmers markets in San Diego that sell organic produce?",
    "Give me the phone number for the nearest post office in Vancouver.",
    "How much was the trading volume for Coca-Cola on June 1st, 2018?",
    "Can you provide me with the sunset and sunrise times for Paris this upcoming Wednesday?",
    "What is the likelihood of precipitation in Rome next week?",
    "I need to find a hospital in Tokyo that specializes in cardiology. Can you provide me with a list?",
    "Can you give me the current weather conditions in London, England?",
    "Can you recommend a hotel in New York City that has a swimming pool?",
    "What is the phone number for the nearest movie theater in Los Angeles?",
    "What is the expected weather forecast for the remainder of the week in the Santa Monica area?",
    "What is the current opening price of Apple in the US market?",
    "What was the closing price of Microsoft on July 1, 2019?",
    "What was the opening price of Alibaba's stock on February 1, 2021?",
    "What are some affordable yet high-quality hotels in downtown Vancouver?",
    "Can you tell me what the exchange volume looked like for General Motors on June 1, 2018?",
    "Can you suggest a good café in Paris that serves croissants and coffee?",
    "Provide me with the website for the Vatican Museums in Rome.",
    "How long will the sun stay up in Anchorage, Alaska, tomorrow?",
    "I have a flight to New York tomorrow. Can you provide me with the expected weather conditions in the city at the time of my arrival?",
    "What are some popular bars in Barcelona, Spain?",
    "Can you tell me the current open status for the US stock market on May 15, 2022?",
    "How windy is it right now in Sydney, Australia?",
    "Find the trading volume of Amazon on March 30, 2021.",
    "What was the closing price of Tesla Inc. on August 25, 2021?",
    "Will it be sunny in New York City two days from now? If not, what will be the average cloud cover?",
    "What are the top-rated coffee shops in Austin?",
    "What is the current market status of the S&P500 index?",
    "Could you tell me if there are any severe weather warnings in effect for the state of Illinois?"
]