[
    "I'm looking for a 24-hour pharmacy in Montreal, can you find one for me?",
    "Can you tell me if there are any weather alerts or warnings currently in effect for Auckland, New Zealand?",
    "Can you give me some information about the historical landmarks in Athens?",
    "How long will the sun stay up in Anchorage, Alaska, tomorrow?",
    "What are some popular tourist attractions in Amsterdam?",
    "How much was Tesla's stock worth on the day it went public?",
    "Give me the trading volume for Amazon on Black Friday in 2020.",
    "Is it safe to travel to Tokyo today given the forecasted weather conditions?",
    "Can you provide me with a list of Italian restaurants in San Francisco that have outdoor seating?",
    "Can you tell me the open status for the London Stock Exchange today?",
    "What was the closing price of Microsoft on July 1, 2019?",
    "What hotels in Las Vegas offer a free shuttle service to the airport?",
    "What was the trading volume of Amazon on June 15, 2018?",
    "How much snowfall is expected in Anchorage, Alaska, next week?",
    "Can you give me the closing price of Exxon Mobil's stock on December 31, 2020?",
    "Can you suggest some good pubs in London?",
    "How cold will it get tonight in Anchorage, Alaska?",
    "How will the weather be for hiking in the Rocky Mountains National Park in Colorado, USA, starting from 3 days from now?",
    "Can you provide a list of wedding venues in Sydney that offer outdoor ceremonies?",
    "Can you recommend some vegan restaurants in Seattle?",
    "Find the highest price of Paypal in 2021.",
    "What is the current market status of the S&P500 index?",
    "Provide the highest and lowest prices for Alibaba's stock in the month of May 2020.",
    "How much was the exchange volume of Amazon on October 1, 2021?",
    "What was Intel's highest trading price in the last year?",
    "What was the closing price of Tesla's stock on the last trading day of 2021?",
    "What was Amazon's stock price at the end of the last trading day of the year 2019?",
    "What will be the sunset time in Rome three days from now?",
    "I'm looking for a gym in Toronto that offers a free trial, can you help me find one?",
    "Is there a McDonald's near the Eiffel Tower in Paris? If so, what is the address?",
    "Please tell me the current close status of the London Stock Exchange.",
    "What will be the weather like in Sydney, Australia next week?",
    "Are there any farmers markets in San Diego that sell organic produce?",
    "Can you help me find a movie theater in London with an IMAX screen, along with its address and website url?",
    "What is the expected weather forecast for the remainder of the week in the Santa Monica area?",
    "Can you recommend a hotel in New York City that has a swimming pool?",
    "Give me the address of the nearest grocery store to the Statue of Liberty.",
    "How windy will it be in Chicago, USA, next Wednesday, and what's the expected wind direction?",
    "Provide me with the website for the Vatican Museums in Rome.",
    "What are the best art galleries to visit in London, UK?",
    "What are some popular food trucks in Austin that serve tacos?",
    "Can you give me a list of bars in New Orleans that have live music?",
    "I'm planning a beach day in Miami, Florida. Will it be a sunny day or should I prepare for rain?",
    "What is the expected pressure in Tokyo tomorrow?",
    "Can you recommend a good seafood restaurant in Boston, Massachusetts?",
    "Is there a park near the Metropolitan Museum of Art in New York City?",
    "Is there a public library in Houston that offers 3D printing services? If so, can you give me its address and hours?",
    "How much did Amazon's stock price increase on February 1, 2022?",
    "Can you provide the visibility distance for Chicago right now?",
    "Is it a good day for surfing in Honolulu today?",
    "Could you tell me if there are any severe weather warnings in effect for the state of Illinois?",
    "Please give me the trading volume of Amazon for the past week.",
    "Can you provide me with the forecast for San Francisco for the next week, including the expected precipitation and wind speed on each day?",
    "What is the likelihood of a thunderstorm occurring in Houston, Texas next weekend?",
    "Could you give me the location of a pet store in San Diego that offers grooming services?",
    "Provide me the trading volume of Amazon's stock on June 3, 2016.",
    "I am interested in knowing the high and low prices of Amazon's stock for the month of June 2021.",
    "Can you give me the trading volume of Google stock on March 5, 2020?",
    "What is the chance of thunderstorms in Rio de Janeiro, Brazil, next week and what will be the temperature and humidity during those days?",
    "Inquire about the exchange volume of Adobe on April 6, 2022.",
    "Can you give me the weather conditions for the next 10 days in London, United Kingdom? I want to plan my wardrobe accordingly for my upcoming trip.",
    "What will be the weather forecast for London, UK, on the fourth day from now?",
    "What is the address of the closest parking lot to the Golden Gate Bridge in San Francisco?",
    "What is the expected visibility in Beijing, China, at 7 pm this evening?",
    "What is the phone number of the nearest 24-hour convenience store to Times Square in New York City?",
    "List all the parking garages near the Staples Center in Los Angeles.",
    "Can you give me the wind speed and direction at the current time in New York City?",
    "I'm looking for a hairstylist who specializes in curly hair. Can you give me a list of salons in Miami?",
    "Recommend some museums in Washington D.C. that are open on Monday.",
    "What is the weather forecast for Paris, France, on the upcoming weekend? Is it a good time for outdoor activities?",
    "What are the top-rated seafood restaurants in Cancun, Mexico with an ocean view?",
    "Can you provide me with the maximum wind speed and direction in Chicago next Monday?",
    "What are some vegetarian restaurants in Los Angeles with their phone numbers and website urls?",
    "What are some popular bars in Barcelona, Spain?",
    "Can I know the humidity levels in Tokyo today, and will it be uncomfortable for people sensitive to humidity?",
    "Look up the lowest stock price of Procter & Gamble on July 8, 2020.",
    "How hot is it in Las Vegas, Nevada today? Should I bring a jacket for the cooler evening temperatures?",
    "What is the current exchange volume for Microsoft stock this month?",
    "I have a flight to New York tomorrow. Can you provide me with the expected weather conditions in the city at the time of my arrival?",
    "I am planning a trip to Sydney, Australia next week, can you give me the expected weather conditions and temperature?",
    "Can you provide me with the closing price of Alibaba Group's stock last month?",
    "Could you suggest a good bookstore that has a large collection of science fiction novels in Chicago?",
    "I am planning a weekend trip to Las Vegas. Can you predict the expected high and low temperature during my trip?",
    "Show me the highest stock price of Amazon on December 24, 2018.",
    "What is the expected humidity level in Dubai, United Arab Emirates in the coming week?",
    "What was the lowest price of Amazon stock on May 21, 2022?",
    "Please look up the close price of Google's stock on February 28, 2020.",
    "What is the address of the nearest pharmacy in San Diego, California?",
    "Can you tell me the current open status for the US stock market on May 15, 2022?",
    "Can you give me the opening price of Microsoft for the month of January 2021?",
    "Can you retrieve the opening and closing price of Tesla on June 12, 2021?",
    "How many shares of Google were traded on July 20, 2020?",
    "What was the closing price of Microsoft's stock on May 3, 2021?",
    "Give me the phone number for the nearest post office in Vancouver.",
    "Is it safe to go hiking in the mountains near Denver, Colorado, today, given the current weather condition and visibility?",
    "I'm planning to go for a boat ride off the coast of Phuket, Thailand, next weekend. Can you tell me what to expect in terms of wind speed and precipitation?",
    "What is the current exchange rate for USD (US Dollar) to EUR (Euro)?",
    "Can you provide me with the sunset and sunrise times for Paris this upcoming Wednesday?",
    "Inquire about the exchange volume of Alibaba stocks in the last quarter.",
    "What is the phone number for the nearest taxi service in Atlanta?"
]