[
    "Please look up the close price of Google's stock on February 28, 2020.",
    "Can you provide me with the details of Apple's stock on the first day of every month in 2021?",
    "How much did Amazon's stock close at yesterday?",
    "What was the closing price of IBM on August 25, 2020?",
    "Can you tell me the current open status for the US stock market on May 15, 2022?",
    "What was the closing price of Tesla stock on December 30, 2021?",
    "How much did the US stock market rise yesterday?",
    "Can you give me the opening price of Microsoft for the month of January 2021?",
    "What is the current exchange rate for the Japanese yen (JPY) to the Chinese yuan (CNY)?",
    "Look up the lowest stock price of Procter & Gamble on July 8, 2020.",
    "How much did Amazon's stock price increase on February 1, 2022?",
    "What is the current market status of the S&P500 index?",
    "Can you give me the trading volume of Google stock on March 5, 2020?",
    "What was the opening price of Facebook's stock on May 10, 2021?",
    "What was the closing price of Microsoft's stock on May 3, 2021?",
    "Show me the highest stock price of Amazon on December 24, 2018.",
    "What is the highest stock price of Google on January 1, 2022?",
    "Can you provide me the opening price of Amazon's stock on January 1, 2021?",
    "What was the open price of Facebook's stock on the first day of trading in the year 2015?",
    "What is the exchange volume for Apple stocks on September 1, 2021?",
    "What is the current opening price of Apple in the US market?",
    "Inquire about the exchange volume of Adobe on April 6, 2022.",
    "Give me the trading volume for Amazon on Black Friday in 2020.",
    "How much was the trading volume for Coca-Cola on June 1st, 2018?",
    "What is the closing price of Johnson & Johnson's stock on July 1, 2015?",
    "What is the current market status in the UK regarding the Dow Jones Industrial Average?",
    "How much was the exchange volume of Amazon on October 1, 2021?",
    "How much was the opening price of Coca-Cola stocks on July 1, 2019?",
    "What is the exchange rate of Japanese yen (JPY) to British pounds (GBP) on December 1, 2021?",
    "How much was the trading volume of General Electric on October 23, 2018?",
    "Please tell me the current close status of the London Stock Exchange.",
    "What was the closing price of Tesla's stock on the last trading day of 2021?",
    "Inquire about the exchange volume of Alibaba stocks in the last quarter.",
    "I am interested in knowing the high and low prices of Amazon's stock for the month of June 2021.",
    "Inquire the open status of the NASDAQ today.",
    "Can you give me the latest information on the Chinese stock market?",
    "Can you provide me with the exchange rate for USD to EUR?",
    "Is the Australian stock market open now?",
    "Can you tell me what the exchange volume looked like for General Motors on June 1, 2018?",
    "Find the highest price of Paypal in 2021.",
    "What was the trading volume of Amazon on June 15, 2018?",
    "What is the opening price of Google on August 24, 2020?",
    "What was the lowest price of Amazon stock on May 21, 2022?",
    "Can you please look up the current closing information for the US stock market?",
    "Can you tell me the open status for the London Stock Exchange today?",
    "Can you provide me with the closing price of Alibaba Group's stock last month?",
    "Please tell me the lowest stock price for Microsoft on June 30, 2021.",
    "Can you retrieve the opening and closing price of Tesla on June 12, 2021?",
    "Check the exchange rate between the British pound and the Australian dollar.",
    "What was the closing price of Tesla Inc. on August 25, 2021?",
    "What is the current stock price and volume of Amazon?",
    "What was the opening price of Alibaba's stock on February 1, 2021?",
    "How much was the opening stock price of Amazon on January 1, 2020?",
    "What is the current exchange volume for Microsoft stock this month?",
    "Please provide the opening price of Facebook on November 4, 2019.",
    "What is the current exchange rate for USD (US Dollar) to EUR (Euro)?",
    "What is the monthly trading volume of Microsoft in October 2020?",
    "What is the closing information for the Nigerian stock exchange for the month of May 2021?",
    "What was the close price for Microsoft on October 5th, 2021?",
    "Can you tell me the closing price of Netflix on February 28th, 2022?",
    "Retrieve the closing price of Coca Cola's stock on January 5, 2015.",
    "Could you retrieve the trading volume of Microsoft's stock on November 30, 2018?",
    "Look up the opening information for the stock market in Brazil today.",
    "How much did Tesla's stock drop on Monday?",
    "Tell me about the highest and lowest prices of NVIDIA on October 10, 2019.",
    "Please provide the exchange volume of Alibaba's stock on December 1, 2021.",
    "Please provide me with the highest price of Facebook's stock in the last quarter.",
    "Find the trading volume of Amazon on March 30, 2021.",
    "What was the highest stock price of Facebook on June 16, 2015?",
    "How much was Tesla's stock worth on the day it went public?",
    "How much did Facebook's stock price change from its opening to its closing on March 15, 2021?",
    "Can you provide me with details about the opening status of the London Stock Exchange?",
    "What is the current opening price of gold on the London Metal Exchange (LME)?",
    "What was the closing price of Microsoft on July 1, 2019?",
    "Could you give me the opening and closing prices of Alphabet's stock on December 25, 2021?",
    "How much is one Chinese yuan (CNY) worth in US dollars (USD) today?",
    "Can you tell me the stock price for Google's opening in the Japanese market?",
    "What was Amazon's stock price at the end of the last trading day of the year 2019?",
    "What is the opening price of Microsoft on August 1, 2021?",
    "Tell me the high price of Amazon's stock on December 1, 2021.",
    "How many shares of Google were traded on July 20, 2020?",
    "Can you provide me the exchange rate for Japanese yen (JPY) to US dollars (USD) in the past month?",
    "Tell me the closing price of Netflix's stock on August 23, 2021?",
    "Provide the highest and lowest prices for Alibaba's stock in the month of May 2020.",
    "Can you tell me the opening price of Walmart stock on the first trading day of this month?",
    "Can you provide the current exchange rate for the United States dollar (USD) to the Euro (EUR)?",
    "Can you give me the highest price of Twitter's stock on January 3, 2020?",
    "Computer, what is the current stock price of General Electric?",
    "Provide me the trading volume of Amazon's stock on June 3, 2016.",
    "What were the open and close prices of Facebook on its first day of trading?",
    "Please give me the trading volume of Amazon for the past week.",
    "What was the opening price of Facebook on December 1, 2021?",
    "Can you provide me the closing price of Google on the previous Friday?",
    "What was the volume of trades made for Coca-Cola on March 1, 2022?",
    "What was the last trading price of Facebook's stock on the date of its initial public offering?",
    "What is the current exchange rate of USD to EUR on the New York Stock Exchange?",
    "What was Intel's highest trading price in the last year?",
    "Can you give me the closing price of Exxon Mobil's stock on December 31, 2020?",
    "Can you provide me with Apple's trading volume on May 10, 2019?",
    "What was the exchange rate from US dollars to GBP yesterday?"
]