[
    "What is the expected weather forecast for the remainder of the week in the Santa Monica area?",
    "What will be the temperature in Bangalore tomorrow?",
    "I have a flight to New York tomorrow. Can you provide me with the expected weather conditions in the city at the time of my arrival?",
    "What is the current cloud coverage in Mumbai, India?",
    "Can you provide the detailed wind conditions for San Francisco Bay Area tomorrow?",
    "Is there a chance of precipitation in Kyoto, Japan next month? If so, what is the expected amount?",
    "Is there any potential for thunderstorms in New York City, United States, later today?",
    "Can you give me the current weather conditions in London, England?",
    "Is there a typhoon warning in Tokyo, Japan today?",
    "Is it a good day for surfing in Honolulu today?",
    "Can you provide me with the weather forecast for Los Angeles next week?",
    "Is there any risk of thunderstorms in Toronto next week? If yes, when is it expected to happen?",
    "I am planning a trip to Seoul, could you give me the weather forecast for the next week, including the chance of snowfall?",
    "Can you provide information about the wind speed and visibility in Honolulu, Hawaii right now?",
    "What is the overall weather condition for the whole day in Cairo, Egypt?",
    "Can you provide the visibility distance for Chicago right now?",
    "I'm planning to go for a boat ride off the coast of Phuket, Thailand, next weekend. Can you tell me what to expect in terms of wind speed and precipitation?",
    "Is it safe to go hiking in the mountains near Denver, Colorado, today, given the current weather condition and visibility?",
    "What is the chance of thunderstorms in Rio de Janeiro, Brazil, next week and what will be the temperature and humidity during those days?",
    "I'm planning an outdoor wedding in Paris next month. Can you provide me with the expected weather conditions and suggest appropriate attire for the guests?",
    "I'm planning a beach day in Miami, Florida. Will it be a sunny day or should I prepare for rain?",
    "Can you give me the temperature in Beijing, China in both Celsius and Fahrenheit?",
    "Can I know the humidity levels in Tokyo today, and will it be uncomfortable for people sensitive to humidity?",
    "How hot is it in Las Vegas, Nevada today? Should I bring a jacket for the cooler evening temperatures?",
    "What is the likelihood of precipitation in Rome next week?",
    "How will the weather be for hiking in the Rocky Mountains National Park in Colorado, USA, starting from 3 days from now?",
    "What is the temperature and humidity in Bangkok's night market?",
    "What is the expected pressure in Tokyo tomorrow?",
    "What will be the sunset time in Rome three days from now?",
    "How strong will the winds be in Amsterdam, Netherlands, on the 17th of September?",
    "How windy will it be in Chicago, USA, next Wednesday, and what's the expected wind direction?",
    "Is there any chance of rain in Tokyo, Japan for the next five days?",
    "How windy is it expected to be in Toronto, Canada tomorrow afternoon?",
    "Will it be sunny in New York City two days from now? If not, what will be the average cloud cover?",
    "What is the weather forecast for Los Angeles on Thanksgiving Day?",
    "Can you provide the wind speed and UV index for Los Angeles, California for the next three days?",
    "Can you provide the weather forecast for New York City, New York, for tomorrow morning at 7 am, including the expected wind speed and direction?",
    "What is the expected visibility in Beijing, China, at 7 pm this evening?",
    "Is there any chance of a thunderstorm in New Delhi, India, this evening, and is it advisable to stay indoors during such conditions?",
    "How much snowfall is expected in Anchorage, Alaska, next week?",
    "How high is the chance of precipitation in Miami, Florida, USA tomorrow?",
    "Can you provide me with the weather forecast for Los Angeles, California for the next 7 days?",
    "What will be the average temperature and pressure in Berlin, Germany two weeks from now?",
    "Can you tell me the overall weather for Sydney, Australia next week?",
    "What is the chance of snowfall in London, UK three days from now, and if it does snow, how much accumulation is expected?",
    "What is the chance of thunderstorms in Miami Beach tomorrow?",
    "I'm planning a road trip from Las Vegas to Denver. Can you provide me with the weather forecast for the entire route?",
    "How much snowfall can we expect in Quebec City, Canada in the next 3 days?",
    "I'm planning an outdoor wedding in Seattle, Washington next month. Can you tell me what the average temperature and humidity will be like during the daytime?",
    "Can you provide me with the maximum wind speed and direction in Chicago next Monday?",
    "Can you provide me with the weather forecast for Miami, Florida for the next 24 hours, including the humidity and visibility?",
    "I'll be taking a road trip from San Francisco to Los Angeles in 2 days. Can you tell me the expected temperature, cloud cover, and visibility levels along the way?",
    "Can you give me the wind speed and direction for Barcelona, Spain for the rest of the day?",
    "I am planning to attend a family reunion at a beach in Hawaii next month. Can you provide the forecast of the temperature, humidity, and UV index during the day time?",
    "Can you provide me with the weather forecast for New York City on July 4th, and what will be the expected high and low temperatures?",
    "I am planning a weekend trip to Las Vegas. Can you predict the expected high and low temperature during my trip?",
    "Can you provide me with the forecast for San Francisco for the next week, including the expected precipitation and wind speed on each day?",
    "How windy is it right now in Sydney, Australia?",
    "Can you provide me with the average temperature and UV index for Cancun, Mexico during the month of August, and is it a good time to visit?",
    "I am planning a hiking trip in the Swiss Alps next month. Can you give me a weather forecast for the region during my stay?",
    "How cold will it get tonight in Anchorage, Alaska?",
    "Could you tell me the current cloud cover percentage in Paris, France, and will it increase or decrease in the next few hours?",
    "Can you tell me the weather forecast for Paris, France for the next 7 days?",
    "I have plans to attend an outdoor wedding in San Diego, California next month. What is the expected weather for that day?",
    "Can you provide me the UV index for Seoul, South Korea in the late afternoon on a typical day in winter?",
    "How long will the sun stay up in Anchorage, Alaska, tomorrow?",
    "I am planning a trip to Sydney, Australia next week, can you give me the expected weather conditions and temperature?",
    "I'm planning a day trip to Paris next week, can you predict the expected UV index levels during that time?",
    "What is the current weather condition in New York City?",
    "What is wind speed expected to be in Cancun, Mexico, tomorrow morning?",
    "Can you tell me the expected temperature of Vancouver, Canada next month during the daytime?",
    "Is it safe to plan an outdoor wedding in Auckland, New Zealand next week based on the expected weather conditions?",
    "What is the pressure trend in Mexico City, Mexico over the last 24 hours?",
    "Can you give me the weather conditions for the next 10 days in London, United Kingdom? I want to plan my wardrobe accordingly for my upcoming trip.",
    "Is it safe to travel to Tokyo today given the forecasted weather conditions?",
    "Can you provide the current weather conditions in Sydney, Australia, including the wind speed and humidity level?",
    "I'm planning to go hiking in the Alps next weekend. Can you tell me the expected wind speed at the summit?",
    "What will be the weather forecast for London, UK, on the fourth day from now?",
    "What is the average temperature in Toronto, Canada for the month of October, and how much rainfall can be expected?",
    "What will be the weather like in Sydney, Australia next week?",
    "What is the weather forecast for Paris, France on New Year's day?",
    "What is the weather forecast for Paris, France, on the upcoming weekend? Is it a good time for outdoor activities?",
    "Could you tell me if there are any severe weather warnings in effect for the state of Illinois?",
    "What is the expected amount of precipitation in Seattle, Washington, this month?",
    "Can you suggest the best time to plan a trek to Everest Base Camp, Nepal, by analyzing the weather forecast?",
    "Is there a chance of thunderstorms in Miami, Florida today and if so, what is the expected amount of precipitation?",
    "I am traveling to Rome, Italy next week, what is the average temperature and daylight hours there during this time?",
    "What is the expected humidity level in Dubai, United Arab Emirates in the coming week?",
    "Can you provide me with the sunset and sunrise times for Paris this upcoming Wednesday?",
    "Can you give me the wind speed and direction at the current time in New York City?",
    "How much precipitation is expected in Seoul, South Korea next month?",
    "Is it going to rain in London next week, and what is the probability of thunderstorms on specific days?",
    "What is the weather like currently in Tokyo, Japan, and what is the expected weather for the rest of the day?",
    "What is the likelihood of a thunderstorm occurring in Houston, Texas next weekend?",
    "What's the expected UV index in Tokyo, Japan, tomorrow?",
    "How much precipitation is expected in London tomorrow morning between 7 to 11 AM?",
    "I'm planning a road trip in the United States, could you suggest the best route for avoiding any potential heavy snowfall during winter?",
    "What is the precipitation rate expected in Toronto, Canada, next Thursday?",
    "Is there a chance of thunderstorms in New York City tonight?",
    "Can you tell me if there are any weather alerts or warnings currently in effect for Auckland, New Zealand?"
]